routes/web.php


/* Main Page */
Route::get('/', function () {
    $post = DB::table('posts')
    ->orderBy('published_at', 'desc')
    ->take(5)
    ->get();
---
select * from `posts` order by `published_at` desc limit 5

});

/* Merch */
Route::get('/merch', function () {
    $merch = DB::table('merch')
    ->get();
    return view('merch', ['merch' => $merch]);
    });
---
select * from `merch` order by `created_at` desc
select * from `merch`

    });

/* Links */
Route::get('/links', function () {
    $link = DB::table('links')
    ->latest()
    ->get();
    return view('links', ['link' => $link]);
    });
---
select * from `links` order by `created_at` desc